app/views/users/show.html.erb

  <strong>microposts:</strong>
  <% if @user.microposts.first.content != null %>
---
SELECT  "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ? ORDER BY "microposts"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]